//@ts-nocheck
import React from "react";

const page = async () => {
  const termText = (
    <>
      <h3>1. 캐시나무 일반 이용약관</h3><br />
      캐시나무는 캐시나무 계정 보유자들에게 캐시나무의 다양한 플랫폼(캐시나무의 웹사이트, 브라우저 확장 및 모바일앱을 포함하되 이에 한정되지 않음)(“캐시나무 플랫폼”)을 통해 이루어진 캐시나무 가맹점에서의 구매에 대해 캐시백을 제공합니다. 캐시나무 플랫폼에서 제공되는 서비스(“본건 서비스”) 및 캐시나무의 계정 이용은 본 조건(“본 약관”)의 적용을 받습니다. 본 약관은 본건 서비스를 이용하거나 캐시나무의 계정을 유지하는 각 개인 간에 법적으로 구속력이 있는 계약을 구성합니다. 본건 서비스를 이용하거나 캐시나무 계정을 유지함으로써, 귀하는 본 약관을 읽고 이해하였음을 인지하고 본 약관의 모든 조건에 구속되기로 동의합니다. 캐시나무는 통지 여부를 불문하고 본 약관을 수시로 수정할 수 있으며, 귀하가 본건 서비스를 계속 이용하거나 캐시나무 계정을 계속 유지하는 것은 귀하가 그러한 수정 사항을 수락하고 그러한 조건을 준수하기로 동의하는 것으로 간주됩니다. <br />
      <br />
      <h3>2. 서비스 라이선스</h3><br />
      본 약관에 따라, 캐시나무는 귀하에게 오로지 개인적인 용도로만 캐시나무 플랫폼과 본건 서비스에 접근하고 이를 이용할 수 있는 취소 가능하고 비독점적이며 양도 불가능한 라이선스(재라이선스 허여 권리 없이)를 허여합니다. 귀하는 본 약관에 따라 명시적으로 허여된 권리 및 라이선스를 제외하고 어떠한 권리도 취득하지 않음에 동의합니다. 캐시나무는 통지 여부를 불문하고 언제든지 본건 서비스 또는 캐시나무 플랫폼의 일부나 전부 또는 본건 서비스 또는 캐시나무 플랫폼의 여하한 기능을 변경, 업그레이드 또는 중단할 수 있는 권리를 보유 합니다. 본 약관에서 명시적으로 허여하지 않은 모든 권리는 캐시나무와 그 라이선스가 보유합니다.<br />
      <br />
      <h3>3. 캐시나무 계정</h3><br />
      본건 서비스 중 일부는 이용자가 캐시나무 계정을 유지할 것을 요구합니다. 이용자는 요청되는 관련 내용을 제공함으로써 무료로 계정을 생성할 수 있습니다. 계정과 본건 서비스의 이용(캐시백을 지급받을 기회 포함)은 캐시나무의 단독 재량에 따라 제공되며 귀하가 본 약관을 준수하는 것을 전제로 합니다.<br />
      캐시백 및 기타 리워드의 발생이나 수령과 관련하여 사기 또는 남용이 있거나 캐시나무나 그 계열사들에게 제공된 정보가 허위 진술인 경우, 귀하의 캐시나무 계정이 의심스러운 활동이 감지된 계정으로 지정되고 정지 또는 해지되고 적립된 캐시백이 몰수될 수 있습니다. 귀하는 캐시백이 적절히 입금되고 귀하의 계정 잔액이 최신으로 업데이트 되는지 확인하기 위해 정기적으로 계정을 확인할 책임이 있습니다. 거래와 관련한 누락, 부정확한 기입 또는 불일치가 있는 경우 귀하는 해당 거래일로부터 30일 이내에 이를 캐시나무에 통지하여야 합니다. 이러한 30일의 기간 이후에 캐시나무이 인지하게 되는 누락, 부정확한 기입 또는 불일치에 대해 캐시나무는 이를 시정 하지 않을 권리를 보유 합니다.  <br />
      <br />
      <h3>4. 캐시백 지급</h3><br />
      캐시나무는 당사의 다양한 캐시나무 플랫폼을 이용하여 캐시나무의 가맹점에서 이루어진 구매에 대해 캐시백을 받을 기회를 제공합니다. 캐시백을 얻기 위해서는 이용자는 캐시나무 계정을 생성하고 유지하여야 합니다. 또한 캐시백 입금은 캐시백 입금과 관련하여 일반적인 다양한 명시적 또는 묵시적 조건 및 요건과 개별적 프로모션과 관련하여 적용되는 조건 및 요건을 따릅니다. 이러한 조건 및 요건은 다음을 포함하나 이에 한정되지 않습니다. <br />
      · 이용자는 캐시나무 플랫폼에 접근하고 가맹점 웹사이트에 접근하는 동안 쿠키를 허용하여야 합니다.<br />
      · 캐시나무 플랫폼에 접근하고 가맹점 웹사이트에 접속하는 동안 별도의 탭이나 브라우저를 열지 않아야 합니다.<br />
      · 가맹점 웹사이트에 연결된 후, 이용자는 다른 웹사이트로 이동하기 전에 거래를 완료하여야 합니다. 주어진 시간 내에 가맹점 웹사이트에서 구매를 완료하여야 합니다.<br />
      · 사기 행위나 부정한 행위에 관여하지 않아야 하며 본 약관의 조건 또는 기타 캐시나무나 관련 가맹점이 명시한 조건을 준수하여야 합니다.<br />
      또한, 특정 구매는 캐시백에서 제외될 수 있습니다. 일반적으로, 캐시백은 배송 및 취급 비용을 제외한 순 구매액에 대해서만 지급됩니다. 다만, 캐시백 금액과 제외 사항은 가맹점마다 차이가 있으며 개별적인 프로모션에는 특정한 제외 사항이 포함될 수 있습니다. 본 조건을 신중하게 검토해 주시기 바랍니다. 이러한 제외 사항은 통지 없이 변경될 수 있으며, 캐시나무는 이에 관련 법률이 허용하는 최대 한도 내에서 부정확한 정보 또는 제외 사항 목록에 미 포함된 정보와 관련하여 발생하는 모든 책임을 부인합니다. 일반적인 제외 사항의 예시는 다음을 포함하나 이에 한정되지 않습니다. <br />
      · 프로모션 대상 제품을 구매하거나 기타 할인 코드, 쿠폰 또는 프로모션을 이용하는 경우 캐시백을 받을 수 없습니다.<br />
      · 특정한 결제 방식을 이용하여 거래를 완료하는 경우에만 캐시백을 받을 수 있습니다.<br />
      · 이용자별로 다른 등급의 캐시백이 적용될 수 있습니다.<br />
      <br />
      <h3>5. 가맹점 정책</h3><br />
      캐시나무를 통하여 가맹점으로부터 구매한 제품 또는 서비스는 해당 가맹점의 정책 및 조건(관련 반품, 취소, 교환 및 배송 정책을 포함하되 이에 한정되지 않음)에 의해 규율되며 이를 따릅니다. 귀하는 당사가 여하한 가맹점의 대리인이 아니며 가맹점이 당사의 통제없이 독립적으로 운영된다는 점에 동의합니다. 이에 따라, 귀하가 가맹점의 제안 또는 프로모션에 참여하거나 가맹점과 교신하는 것은 전적으로 귀하와 해당 가맹점 간에 이루어집니다. 당사는 그러한 교신, 제안이나 프로모션(그러한 제안이나 프로모션의 철회 또는 수정을 포함하되 이에 한정되지 않음)에 대해 일체의 의무나 책임을 부담하지 않습니다. 캐시나무는 캐시나무의 플랫폼에서의 가맹점의 변경 또는 중단, 가맹점이 캐시나무의 플랫폼에서 제안한 여하한 프로모션의 종료 또는 그러한 변경, 중단, 철회 등이 캐시백의 발생에 미치는 영향에 대하여 책임을 지지 않습니다. 캐시나무는 가맹점의 플랫폼 상의 컨텐츠, 제품 또는 서비스(제품 또는 서비스의 품질, 상품성 또는 적합성 또는 그러한 컨텐츠, 제품 또는 서비스가 여하한 법령을 위반하지 않음을 포함하나 이에 한정되지 않음)에 대해 어떠한 책임도 부담하지 않습니다. <br />
      <br />
      <h3>6. 추가 지급 및 공제</h3><br />
      캐시나무는 필요하거나 합리적이거나 적정한 경우 관련 법률이 허용하는 최대 한도 내에서 이용자의 계정의 잔액에 수시로 추가 지급을 하거나 이를 공제할 권리를 보유합니다. 이러한 경우에는 이용자의 계정에 캐시백이 부정확하게 입금되었거나, 이용자가 사기 또는 부정한 행위를 하거나 본 약관의 조건을 위반한 것이 발견되는 상황이 포함되나 이에 한정되지 않습니다. <br />
      <br />
      <h3>7. 캐시백 환급</h3><br />
      귀하는 언제든지 본 약관의 조건 또는 귀하의 계정에 개별적으로 입력한 사항에 따른 특정한 조건에 따라 귀하의 캐시백을 환급할 수 있습니다. 귀하는 원화 기준으로 최소 환급 금액 10,000원 이상의 캐시백을 환급할 수 있습니다. 캐시백 환급을 위해서는 활성화된 계정을 유지하여야 하며, 환급을 처리하기 위해 필요한 최소한의 관련 정보(유효한 은행 계좌번호)를 제공하여야 합니다. 보안 목적상, 캐시백 환급은 24시간 기준 150,000원을 초과할 수 없습니다. <br />
      <br />
      <h3>8. 캐시백의 성격</h3><br />
      귀하는 귀하의 계정의 캐시백을 지급 받는 경우 캐시나무의 보유금이나 자산에 대한 전유적 권리를 취득하지 않습니다. 귀하의 계정에 발생한 캐시백은 귀하의 이익을 위하여 캐시나무가 신탁에 보유하는 금액을 구성하지 않습니다. 귀하의 권리 및 권한은 오로지 본 약관에 따라 발생할 수 있는 개인적 또는 계약상의 환급에 대한 권리로 제한됩니다. <br />
      <br />
      <h3>9. 계정의 해지</h3><br />
      귀하의 캐시나무 계정에 적립된 캐시백은 귀하의 계정이 일 년 이상의 기간 동안 비활성화 상태(즉, 캐시나무을 통해 거래가 성공적으로 이루어지지 않은 경우)인 경우 소멸합니다. 캐시나무는 아래의 제13조에 따라 또는 법령이나 법원 명령을 따르기 위하여 필요하거나 합리적인 경우에 귀하의 계정을 정지 또는 해지할 수 있는 권리를 보유 합니다. <br />
      <br />
      <h3>10. 개인정보 보호</h3><br />
      수집된 개인정보는 당사의 개인정보 보호방침의 적용을 받으며, 해당 방침은 언급됨으로써 본 약관에 포함됩니다. <br />
      <br />
      <h3>11. 보너스 및 리워드</h3><br />
      캐시나무는 특정 행위의 수행(캐시나무에 신규 이용자를 유입하는 등의 행위)에 대해 주기적으로 보너스 또는 리워드를 제안합니다. 이러한 제안에 수반되는 조건들은 보너스 및 리워드의 지급 방식을 규율합니다. 귀하는 귀하의 페이지에 트래픽을 증가시키기 위한 목적으로 “캐시나무”나 이와 유사한 단어나 표장을 포함하는 키워드를 입찰할 수 없습니다. 귀하는 귀하의 리퍼럴 링크(referral link)로 직접적으로 어떠한 유료 트래픽도 전송해서는 안됩니다. 귀하는 가맹점에 속하는 소셜 미디어 페이지, 제3자에게 속하는 포럼 페이지 등 귀하에게 속하지 않은 웹사이트 또는 플랫폼에 귀하의 리퍼럴 링크를 포함하거나 배포할 수 없습니다. <br />
      <br />
      <h3>12. 세금</h3><br />
      귀하는 귀하가 캐시백을 환급받은 금액에 적용될 수 있는 모든 세금에 대하여 책임을 집니다. 캐시나무는 이러한 금액의 세무 처리에 대해 어떠한 진술도 하지 않습니다. <br />
      <br />
      <h3>13. 사기</h3><br />
      귀하의 계정이 사기 또는 부정한 활동에 연루되었다고 믿을 만한 사유가 있는 경우 캐시나무는 이를 정지하거나 해지할 수 있습니다. 본 약관을 준수하지 않거나, 서비스 또는 귀하의 계정 이용과 관련한 사기, 부정 또는 남용 행위가 있거나 귀하 또는 귀하를 대리하는 자가 캐시나무나 그 계열사들에게 제공한 정보가 허위 진술인 경우, 귀하의 캐시나무 계정이 해지되고 발생한 캐시백 리워드가 몰수될 수 있습니다. <br />
      <br />
      <h3>14. 제3자의 권리</h3><br />
      본 약관의 당사자가 아닌 자는 본 약관의 어떠한 조건도 집행할 권리가 없습니다. <br />
      <br />
      <h3>15. 커뮤니케이션</h3><br />
      캐시나무의 이용자가 됨으로써, 귀하는 계정 및 이용자와 관련한 정보(당사의 귀하의 계정으로의 캐시백 지급, 귀하의 은행 계좌로의 현금 지급 등) 및 캐시나무 이용자가 이용할 수 있는 쿠폰 또는 특가 상품을 포함하는 정기적인 쇼핑 관련 이메일을 수신하기로 동의합니다. 당사는 귀하가 등록 과정에서 제공하는 정보를 이용하여 전자적 커뮤니케이션이나 광고용 우편물을 통해 귀하의 계정에 관해 귀하와 커뮤니케이션할 수 있습니다. 귀하의 전자적 커뮤니케이션 수신 동의에는 통지 또는 기타 법률에 의해 귀하에게 서면 등으로 제공하도록 요구될 수 있는 정보가 포함됩니다. 귀하는 귀하의 현재 이메일 주소가 회원이 되는 날 이후 변경된 경우 당사에 알리기로 동의합니다. 당사는 또한 귀하가 모바일 앱을 설치하는 경우 귀하에게 푸시 알림을 전송할 수 있습니다. <br />
      <br />
      <h3>16. 소유권</h3><br />
      본건 서비스, 캐시나무 플랫폼 및 이와 관련한 컨텐츠에 대한 모든 권리, 소유권 및 이권은 캐시나무 또는 그 라이센스에게 귀속됩니다. 또한, 캐시나무는 로고 및 캐시나무의 기타 표장, 서비스표, 상표 에 대한 모든 권리, 소유권 및 이권을 유지합니다.. 귀하는 “캐시나무(CASHNAMU)”, 이와 사실상 유사한 단어 또는 기타 캐시나무를 포함하는 키워드를 여하한 검색 엔진, 도메인 서비스 제공자 또는 특허청에 어떠한 방식으로도 입찰, 신청, 등록, 소유 또는 통제하지 않습니다. 귀하는 캐시나무의 명시적인 서면 동의 없이 캐시나무을 광고 문구, 광고 확장 또는 배너 광고에서 언급하거나 사용하지 않습니다. 본건 서비스 제공에 사용되는 캐시나무의 소유가 아닌 모든 기타 상표들은 캐시나무의 계열사이거나 캐시나무과 연관이 있거나 캐시나무가 후원하거나 그렇지 않을 수 있는 각 소유자의 자산입니다. <br />
      <br />
      <h3>17. 커뮤니티 기준</h3><br />
      캐시나무의 계정을 생성함으로써, 귀하는 당사의 각 이용자의 선의 및 책임감 있는 행동에 기반하는 커뮤니티의 회원이 됩니다. 이용자들은 민족적 비방, 외설, 성적으로 노골적인 내용, 선동 또는 폄하 발언에 해당하는 이미지나 텍스트 또는 본건 서비스, 캐시나무 플랫폼, 당사의 직원, 계약자 또는 대리인, 당사의 가맹점 또는 기타 이용자들을 타겟으로 한 괴롭힘 또는 모욕으로 해석될 수 있는 모든 내용을 전송하거나 전달하지 않아야 합니다. 여기에는 위 커뮤니티 기준을 위반하거나 게임이나 사기 행위를 촉진 또는 장려하는 소셜 미디어나 기타 인터넷 게시물을 통한 커뮤니케이션이 포함됩니다. 당사는 그 절대적인 재량에 따라 본 조항을 위반하는 이용자의 계정을 사전 통지 없이 정지 또는 해지할 수 있습니다. <br />
      <br />
      <h3>18. 면책</h3><br />
      귀하는 귀하의 본 약관 위반과 관련하여 발생하는 일체의 청구, 손해, 손실 및 청구원인(변호사 비용 및 법원 비용 포함) 또는 귀하가 제공하는 여하한 형태의(또는 귀하의 이용자명 또는 비밀번호를 통한) 자료에 대하여 캐시나무, 가맹점, 그들 각각의 임원, 이사, 직원, 승계인, 대리인 및 계열사를 면책하기로 동의합니다. 귀하는 당사의 청구 방어 또는 합의에 있어서 합리적으로 필요한대로 최대한 협조하기로 동의합니다. 당사는 당사의 합리적인 재량에 따라 귀하로부터 면책 받는 사안의 방어 및 합의와 관련하여 독점적 통제권을 확보할 권리를 보유 합니다. <br />
      <br />
      <h3>19. 보증의 부인</h3><br />
      본건 서비스, 컨텐츠 및 캐시나무 플랫폼은 여하한 종류의 명시적 또는 묵시적 보증(소유권, 상품성, 특정 목적에의 적합성 또는 비침해의 보증을 포함하되 이에 한정되지 않음) 없이 “현 상태로” 제공됩니다. 당사는 관련 법률이 허용하는 최대 한도 내에서 본건 서비스, 컨텐츠 또는 캐시나무 플랫폼(제품 검색결과, 제품 설명, 제품 이용가능성, 가격 책정 정보 자문, 의견, 진술, 추천 또는 기타 본건 서비스와 관련하여 게시, 업로드 또는 유통되는 정보를 포함하되 이에 한정되지 않음)의 품질, 정확성, 유통성, 완전성, 신뢰성 또는 유효성에 대해 일체의 보증을 하지 않습니다. 관련 법률이 허용하는 최대 한도 내에서 캐시나무는 캐시나무 플랫폼의 기능이 중단되거나 오류가 발생하지 않고, 결함이 시정되며, 캐시나무 플랫폼이 바이러스나 기타 유해한 콘텐츠로부터 자유롭다는 내용의 보증을 하지 않습니다. 더 나아가, 관련 법률이 허용하는 최대 한도 내에서 캐시나무는 그 계열사들이 서비스와 함께 제안하거나 제공하는 제품 또는 서비스의 품질 또는 그 광고의 정확성에 대하여 보증, 보장 또는 진술을 하지 않습니다. <br />
      <br />
      <h3>20. 책임의 제한</h3><br />
      관련 법률이 허용하는 최대 한도 내에서, 캐시나무는 어떠한 경우에도 특별적, 부수적, 결과적, 징계적, 징벌적 또는 기타 간접적 손해 또는 이익, 손실 데이터 또는 사용 기회 손실에 대하여 책임을 지지 않으며, 이는 캐시나무가 그러한 손해의 가능성에 대해 고지 받은 경우에도 적용됩니다. 관련 법률상 허용되는 최대 한도 내에서, 본 약관으로 인해 발생하는 캐시나무의 총 책임은 최대 10만원을 초과하지 않습니다. <br />
      <br />
      <h3>21. 준거법</h3><br />
      본 약관은 캐시나무가 그 재량에 따라 수시로 변경하는 내용을 포함하여 대한민국 법률에 따라 규율 및 해석됩니다. <br />
      <br />
      <h3>22. 양도</h3><br />
      귀하는 사전 서면 동의 없이 본 약관에 따른 귀하의 권리 및 의무의 전부 또는 일부를 양도할 수 없으며, 이러한 동의 없이 이루어진 양도는 무효가 됩니다. <br />
      <br />
      <h3>23. 포기 및 분리성</h3><br />
      캐시나무는 본 약관의 여하한 규정을 집행하지 않는 경우, 이는 해당 규정을 포기하는 것으로 간주되지 않습니다. 캐시나무가 어느 한 경우에 본 약관의 여하한 규정을 포기하는 경우 이는 다른 경우에 다른 규정이나 해당 규정을 포기하는 것으로 간주되지 않습니다. 본 약관의 여하한 규정이 무효로 되는 경우, 그러한 무효성은 나머지 규정에 영향을 미치지 않습니다. <br />
      <br />
      <h3>24. 완전한 합의</h3><br />
      본 약관은(본 약관에 또는 일반적으로 언급되는 추가적인 조건들과 함께) 본 약관의 대상과 관련하여 당사자들의 완전한 합의를 구성하며, 이전 또는 현재의 서면 또는 구두 계약 및 진술(귀하가 수락하였을 수 있는 본 약관의 이전 버전을 포함하되 이에 한정되지 않음)을 대체합니다. 당사는 언제든지 본 약관을 수정할 권리를 보유 합니다. 귀하가 계속해서 캐시나무 서비스를 이용하거나 캐시나무의 계정을 유지하는 경우 귀하는 이러한 수정 사항을 수락하는 것으로 간주되며, 본 약관의 조건을 준수하기로 동의하는 것으로 간주됩니다.<br />
      <br />
      업데이트: 2022년 12월 28일<br />
    </>
  )
  return (
    <>
      {termText}
    </>
  );
};

export default page;
