//@ts-nocheck
import React from "react";

const page = async () => {
  const termText = (
    <>
      <h3>1. 개인정보 고지사항</h3><br />
      Cashnamu(이하 “캐시나무” 또는 “당사”)는 당사가 서비스를 제공하는 과정에서 접하는 모든 분들(고객, 방문자 등)의 개인정보 보호를 중시합니다. 당사는 고객들께 더 나은 쇼핑 경험을 제공하고자 노력합니다. 고객들께서 개인정보의 보안에 대해 우려하시는 점을 인지하고 있는 바, 제공받는 모든 개인정보를 고객이 동의한 목적에 한하여 안전하게 사용하고 있습니다.
      당사는 고객이 요청한 서비스를 제공하고, 고객의 필요를 파악하고 더 나은 서비스를 제공하는데 필요한 개인정보만을 수집한다는 점을 우선적으로 알려드립니다. 당사는 가능한 한 최소한의 정보만을 수집합니다. 당사는 고객의 리워드를 확인하고 추적하기 위하여 필요한 정보만을 당사의 가맹 업체들에 제공합니다.<br />
      일례로, 당사가 캐시백을 인증하고 고객의 캐시나무 계정으로 입금하기 위하여 고객과 당사의 가맹 업체들간의 거래 내역이 필요한 관계로, 당사는 해당 정보를 추적하는데 쿠키를 이용하고 있습니다.<br />
      기타, 제공되는 정보는 집계하는 수준으로 제한하고 있습니다.<br />
      당사는 어떠한 경우에도 고객의 정보를 판매하지 않습니다.<br />
      당사는 고객이 제공한 개인정보의 수집, 이용, 공개를 보호하기 위한 방침, 관행, 절차를 개인정보 보호 관련 법률에 준하여 이행하고 있습니다.<br />
      당사의 개인정보 보호방침은 아래와 같습니다. 당사는 개인정보 보호와 보안을 중시하며, 이에 관한 어떠한 피드백도 수용하고자 합니다. 문의사항, 의견, 우려사항이 있으신 경우 또는 도움이 필요하신 경우, help@cashnamu.com으로 문의하여 주시기 바랍니다.<br />
      <br />
      <h3>2. 개인정보 보호방침</h3><br />
      당사는 본 개인정보 보호방침(이하 “본 방침”)을 통하여 당사가 당사의 웹사이트, 데스크탑 웹 브라우저 확장(이하 “웹 확장”), 소프트웨어 앱, 모바일 앱, 기타 플랫폼 이용자 및 고객의 개인정보를 어떠한 방식으로 관리, 수집, 이용, 공개하는지 알려드립니다. 당사는 개인정보 보호 관련 법률에 의거하여 사업을 영위하고 있으며, 고객의 개인정보를 보호하기 위하여 추가적인 조치를 이행하고 있습니다. 당사가 지속적으로 당사의 서비스를 제공하고 고객이 지속적으로 당사의 서비스를 이용하는 경우, 당사의 웹사이트에 수시로 업데이트되는 본 방침을 준수하기로 상호 합의하였다고 간주됩니다.<br />
      <br />
      <h3>3. 개인정보</h3><br />
      본 방침에서 “개인정보”란 그 사실 여부와 상관없이 해당 정보로부터 개인을 식별할 수 있는 정보, 또는 당사가 보유하거나 접근할 수 있는 정보(수시로 업데이트 되는 당사의 기록상 정보 등)를 의미합니다.<br />
      <br />
      <h3>4. 개인정보 수집</h3><br />
      당사가 수집하는 개인정보는 고객이 사용하거나 가입한 제품, 서비스, 프로모션에 따라 다릅니다. 당사는 당사의 서비스 및 플랫폼이 제대로 작동하고, 해당 서비스 및 플랫폼이 각종 기기들과 브라우저에서 작동하는 방식에 대하여 명료하게 이해하기 위하여 정보를 수집합니다. 당사가 일반적으로 고객의 개인정보를 수집하는 방법은 다음과 같습니다.<br />
      · 당사의 웹사이트, 앱, 미디어 플랫폼, 브라우저 확장 프로그램을 방문, 이용, 설치한 후 연락처를 남기는 경우 또는 기타 포털을 통하여 문의하는 경우<br />
      · 당사의 서비스에 가입하는 경우 또는 당사의 제품∙서비스에 관한 여하한 양식을 제출하는 경우<br />
      · 알림이나 뉴스레터 수신을 신청하는 경우 또는 당사의 마케팅 자료(광고, 브로셔, 전단지 등)에 회신하는 경우<br />
      · 당사 또는 당사의 직원과 (온라인 인터페이스, 이메일, 전화 통화, 팩스, 문자, 대면 회의를 통하여) 연락, 지원 요청, 교신, 소통하는 경우<br />
      · 설문조사, 기타 행사에 참여한 경우<br />
      · 귀하의 이력서와 지원서를 당사에 제출하거나, 채용 회사 또는 구직 포털에 제출하여 당사에 동 서류가 전달된 경우<br />
      · 협력업체 또는 제3자가 당사에 고객을 언급하는 경우<br />
      · 당사가 수집하는 고객의 개인정보는 아래의 항목을 포함합니다.<br />
      · 신원 : 이름, 이메일, 생년월일, IP 주소, 결제 정보(은행 계좌 정보와 같은 지급 서비스 제공자의 계정 등)<br />
      · 당사와의 교신 : 당사와의 통화 내용 녹음, 고객이 발송한 이메일, 당사와 고객간 이루어진 연락에 대한 기록<br />
      · 계정 : 고객의 캐시나무 계정 관련 내역<br />
      · 서비스 이용 : 쿠키, 웹 확장 프로그램, 기타 브라우저 관련 방법을 이용하여 고객과 당사 또는 당사의 가맹업체 웹사이트 간의 교신 내역(고객이 당사의 웹사이트에서 방문한 페이지 및 해당 웹페이지에 접속해 있는 시간, 고객이 당사의 웹사이트에서 검색한 제품 및 정보, 접속 일시, 고객이 당사의 웹사이트를 방문하기 전에 방문한 웹페이지, 클릭 및 리디렉트에 관한 정보 등)<br />
      · 선호: 고객이 선호하는 연락 방법, 제품, 브랜드에 관하여 공유한 정보<br />
      · 위치: 당사가 제공하는 일부 서비스는 고객의 위치에 따라 다릅니다. 해당 서비스가 작동하기 위해서는 고객의 위치 정보가 필요합니다. 고객이 모바일 기기 등에서 당사의 플랫폼(앱 등)에 접속하여 플랫폼을 사용∙교신하는 경우, 당사는 고객의 위치에 맞게 서비스를 제공하기 위하여 위치 정보를 이용합니다. 서비스는 고객의 기기에서 ‘위치서비스’를 이용하여 특가, 플랜, 주변의 흥미로운 것들에 대한 알림을 발송합니다. 고객이 ‘위치서비스’를 켜놓은 경우, 고객이 당사의 플랫폼과 직접적으로 교신하지 않더라도 때때로 당사의 플랫폼이 당사에 고객의 기기 위치를 전달할 수 있습니다.<br />
      당사는 고객 또는 그 수권된 대리인으로부터 직접적으로 개인정보를 수집하는 것 이외에도 제3자(협력업체, 구글, 소셜 미디어 제공업체, 사기 방지 업체 등) 또는 대중에게 알려진 출처로부터 개인정보를 수집할 수 있습니다.<br />
      또한, 당사는 “쿠키”를 이용합니다. “쿠키”는 고객이 당사의 웹사이트에 접속 시 고객에 대한 정보를 저장∙추적하도록 브라우저에 보내는 작은 정보 파일로, 앞서 설명 드린 당사의 서비스 이용에 관한 정보를 추적하기 위하여 사용됩니다.<br />
      대부분의 인터넷 브라우저에서 쿠키 옵션을 끌 수 있지만, 쿠키 옵션을 끄는 경우 기능이 저해되거나, 웹사이트를 제한적으로 이용하게 되거나, 웹사이트 운영이 지연되거나 영향 받을 수 있습니다. 무엇보다 당사가 고객과 가맹업체 간의 거래를 추적하지 못하게 되어 고객님께 캐시백을 입금하거나 요청하신 제품∙서비스를 제공하지 못하게 됩니다. <br />
      <br />
      <h3>5. 정보의 정확성 및 제3자 동의</h3><br />
      고객은 완전하고, 정확하며, 진실되는 개인정보만을 제출하여야 합니다.<br />
      그렇지 않거나, 고객이 제3자(고객의 배우자, 자녀, 부모, 직원 등)에 관한 개인정보를 제공하는 경우 당사는 요청하신 제품 및 서비스를 제공하지 못할 수 있습니다.<br />
      <br />
      <h3>6. 개인정보 보안</h3><br />
      당사는 수집한 모든 개인정보를 안전하게 보관∙보호하기 위하여 다음과 같은 엄격한 조치를 이행합니다.<br />
      · 보안 침입을 방지하기 위하여 오로지 적절한 보호조치를 갖춘 서버에서만 고객의 개인정보를 저장하고 있습니다.<br />
      · 당사의 시스템상 정보에의 접근을 제한하고 있습니다.<br />
      · 개인정보에의 무단 접근을 방지하기 위하여 엄격한 인증 절차를 이행하고 있습니다.<br />
      · 당사의 사업 또는 법적 절차상 더 이상 필요하지 않은 경우 고객의 개인정보를 안전하게 파기하고 있습니다.<br />
      <br />
      <h3>7. 개인정보 이용</h3><br />
      당사는 온라인에서 수집한 개인정보를 제3자에게 판매하거나 거래하지 않습니다.<br />
      당사는 다음과 같은 목적으로 고객의 개인정보를 이용할 수 있습니다.<br />
      <br />
      <h4>7.1 서비스 관리</h4>
      당사는 주로 고객의 주문과 캐시백을 이행하고 처리하기 위하여 고객의 개인정보를 이용합니다. 고객의 개인정보를 이용하여 고객과 당사의 가맹 업체 간의 거래 내역을 추적하고, 고객의 캐시나무 계정으로 캐시백 리워드를 입금하고, 해당 거래를 위하여 필요한 결제를 처리하는 업무가 이에 포함됩니다. 고객의 개인정보를 이용하여 서비스를 활성화/비활성화하고, 고객에게 추가적인 제품, 서비스, 혜택(프로모션, 로열티 프로그램, 리워드 프로그램 등)을 제공하고, 판촉 행사, 경연, 대회, 기업의 사회적 책임 프로젝트를 (때로는 당사의 제휴 파트너와 함께) 관리하는 업무 또한 이에 포함됩니다.<br />
      <br />
      <h4>7.2 서비스 향상</h4>
      당사는 불만사항, 클레임, 분쟁을 조사하기 위하여 고객의 개인정보를 이용합니다. 또한 고객이 당사의 서비스 품질에 관한 문의사항이나 피드백을 주시는 경우, 사이트와 서비스 성능, 서비스 제공을 개선하기 위하여 고객의 개인정보를 이용합니다. 고객의 선호, 신제품 및 서비스 개발, 당사가 고객에게 제공하는 제품∙서비스를 맞춤화하고 개선하기 위하여 고객의 개인정보를 이용할 수 있습니다. 일반적인 광고 또는 고객이 특히 관심을 가질만한 광고(당사의/당사의 제휴 파트너의 제품, 서비스, 특가, 혜택에 대한 내용 등)를 전송하거나, 고객이 사전에 동의하는 경우 또는 현지 법령에 따라 허용되는 경우 고객에게 정기 뉴스레터를 전송하거나, 혜택을 홍보하고 고객에게 해당되는 캐시백 및 프로모션을 제공하는 등이 이에 포함됩니다.<br />
      <br />
      <h4>7.3 고객 서비스</h4>
      당사는 고객(또는 고객의 권한을 위임받은 자)의 요청 및 문의사항에 답변하고, 당사의 제품, 서비스, 방침에 관한 소식을 전해드리기 위한 목적으로 고객의 개인정보를 이용합니다.<br />
      <br />
      <h4>7.4 보안 및 준법</h4>
      당사는 (돈 세탁, 테러 지원, 관련 위험을 통제하는 등) 사기 및 기타 범죄를 탐지∙ 예방하고, 내사를 실시하고, (법 집행/사법/기타 정부 기관을 지원하거나, 규제기관에 대한 항의에 대응하거나, 규제 당국에 관련 내용을 공개하거나, 조사/실사를 진행하고, 당사가 소송 또는 장래의 소송에 필요하다고 생각되는 조치를 취하는 등) 법적∙규제 요건을 준수하기 위한 목적으로 고객의 개인정보를 이용합니다. 보안, 리스크 관리, 당사의 재산 및 시스템 안전 확보 등의 목적으로 고객의 개인정보를 이용하는 것도 이에 포함됩니다.<br />
      <br />
      <h4>7.5 구직</h4>
      채용 신청서 처리, 채용, 선정, 고용 기록의 처리 및 관리 등이 이에 포함됩니다.<br />
      당사는 고객에게 고지한 목적 이외의 목적, 현지 법령에 따라 허용되는 바 이외의 용도로 고객의 개인정보를 이용하지 않습니다. 당사는 사업적, 법적으로 필요한 기간에 한하여 고객의 개인정보를 보유합니다.<br />
      <br />
      <h3>8. 개인정보 공유</h3><br />
      당사는 고객의 개인정보를 다음과 같이 공유할 수 있습니다.<br />
      · 캐시나무 그룹 내 회사와 공유할 수 있습니다.<br />
      · 캐시나무의 협력업체, 판매자, 대리업체, 고객이 신청한 서비스를 제공하기 위하여 협력하는 서비스 제공업체와 공유할 수 있습니다. 가맹업체, 지급 서비스 제공자, 당사 또는 당사의 제휴 파트너가 제공하는 마케팅 프로모션 및 서비스를 제공하는 제3자 서비스 제공자, 당사에 운영 서비스(통신, 정보 기술, 결제, 인쇄, 청구, 급여, 처리, 기술적 서비스, 교육, 시장 조사, 콜센터, 기타 당사에 제공하는 서비스)를 제공하는 제3자 서비스 제공자, 감사 및 변호사 등 전문 자문인들이 이에 포함됩니다.<br />
      · 사업 자산 거래 또는 장래의 사업 자산 거래(합병, 인수, 자산 매각 등) 시, 해당 거래를 이행하기 위하여 협력업체, 투자자, 양수인과 공유할 수 있습니다.<br />
      · 여하한 법령, 지침, 제도에 따라 요구되는 관련 규제기관, 법률 당국, 위원회, 당국, 또는 법률집행기관과 공유할 수 있습니다.<br />
      개인정보는 오직 상술한 목적(본 방침에 기재된 내용 참고) 또는 고객의 이익을 보호하기 위한 목적으로 이용됩니다.<br />
      당사는 생명이나 건강상의 위험을 방지하거나 법을 집행하기 위하여 필요하다고 간주되는 예외적인 경우, 고객의 개인정보를 공개할 수 있습니다. 일부 경우, 당사는 개인정보를 공유하기 이전에 암호화, 익명화 및 집계화합니다. 익명화란 개인을 식별할 수 있는 정보를 제거하는 것을 뜻합니다. 집계화란 정보를 그룹 또는 부문(나이대 등)별로 분류하는 것을 의미합니다.<br />
      <br />
      <h3>9. 뉴스레터</h3><br />
      고객이 캐시나무의 이용자로 가입하는 경우, 당사는 고객이 제공한 개인정보를 이용하여 광고 이메일을 전송합니다. 광고 이메일을 통하여 당사 또는 당사의 제휴 파트너가 제공하는 가장 최신의 특가, 리워드, 딜, 제품 또는 서비스에 대하여 고객님께 업데이트 드립니다. 고객은 언제든지 광고 이메일의 ‘그만 받아보기 기능’을 통하여 광고 이메일을 그만 받아볼 수 있습니다.<br />
      <br />
      <h3>10. 개인정보 업데이트</h3><br />
      고객은 언제든지 캐시나무 웹사이트의 계정으로 접속하여 고객의 개인정보를 수정할 수 있습니다. 캐시나무 웹사이트를 통하여 정보를 수정할 수 없는 경우 help@cashnamu.com으로 연락 주시면 최대한 신속히 도와드리겠습니다.<br />
      <br />
      <h3>11. 개인정보에의 동의 및 접근</h3><br />
      고객의 개인정보에 접근하거나, 근 1년간 당사가 고객의 개인정보를 사용∙공개한 방법을 문의하거나, 개인정보의 사용에 대한 동의를 철회하고자 하는 경우, 당사(및 당사의 정보보호 책임자)에 help@cashnamu.com로 연락 주시기 바랍니다. 당사는 합리적으로 최선을 다하여 고객의 요청을 처리할 것입니다만, 고객의 개인정보를 회수하기 위하여 합리적인 행정 수수료를 부과할 수 있다는 점을 말씀 드립니다.<br />
      고객은 언제든 당사의 정보 수집, 이용, 공개에 대한 동의를 철회할 수 있습니다. ‘웹 확장 프로그램 삭제’ 또한 이에 포함됩니다. 그러나 고객의 개인정보 이용 및/또는 공개에 대한 동의를 철회하시는 경우, 당사는 그 성격에 따라 고객에게 제품 또는 서비스를 제공하지 못하거나 고객과의 계약을 이행하지 못할 수 있음을 양지하시기 바랍니다. 이 경우 당사는 법적 권리 및 구제권을 명시적으로 보유합니다.<br />
      <br />
      <h3>12. 개인정보 보호방침의 변경</h3><br />
      당사는 산업 트렌드 또는 법률, 규제 요건의 변경에 따라 언제든 본 방침을 개정 및 수정할 권리를 보유합니다. 고객의 법적 권리에 따라 고객은 수시로 당사의 웹사이트에 업데이트되는 본 방침의 적용을 받는데 동의합니다. 본 방침에 대한 여하한 변경 내용은 당사의 웹사이트에 게시됩니다.<br />
      <h3>13. 준거법</h3><br />
      본 방침 및 고객의 웹사이트 이용은 고객이 위치한 국가의 법률에 따라 규율 됩니다.<br />
      <br />
      <h3>14. 캐시나무 개인정보 보호방침 부칙</h3><br />
      다음은 캐시나무의 개인정보 보호방침의 부칙(본 “부칙”)이며, 캐시나무 개인정보 보호방침과 함께 숙지되어야 합니다. 캐시나무 개인정보 보호방침과 함께, 본 부칙은 당사의 서비스를 제공하는 과정에서의 한국에 거주하는 캐시나무 이용자들의 개인정보 보호, 수집 및 이용에 대한 캐시나무의 방침을 설명합니다. 본 부칙은 수시로 수정 또는 업데이트될 수 있습니다.<br />
      <br />
      <h3>15. 수집하는 개인정보</h3><br />
      수집하는 개인정보에 관해서는 “개인정보 수집” 조항을 참고하시기 바랍니다.<br />
      <br />
      <h3>16. 수집 목적, 이용 및 방법</h3><br />
      개인정보 수집의 목적, 이용 및 방법에 관해 더 자세한 내용은 “개인정보 수집” 및 “개인정보 이용” 조항을 참고하시기 바랍니다.<br />
      <br />
      <h3>17. 개인정보 보유 및 이용 기간</h3><br />
      개인정보 수집 및 이용의 목적과 수집 방법에 관해서는 “개인정보 이용” 조항을 참고하시기 바랍니다.<br />
      캐시나무는 캐시나무 개인정보 보호방침에 명시된 사유들과 관련하여 개인정보의 이용이 필요한 기간 및 다음의 규정들을 포함한 관련 법률에 따라 캐시나무가 개인정보를 보유하도록 요구되는 기간 동안 귀하의 개인정보를 보유합니다.<br />
      ※ 전자상거래 등에서의 소비자보호에 관한 법률<br />
      · 주문 취소 또는 계약 해지에 관한 기록: 5년<br />
      · 제품 결제 또는 제공에 관한 기록: 5년<br />
      · 소비자 불만 및 분쟁에 관한 기록: 3년<br />
      ※ 통신비밀보호법<br />
      · 로그 또는 접근 기록: 3개월<br />
      <br />
      <h3>18. 개인정보 파기 절차 및 방법</h3><br />
      개인정보 파기 시, 캐시나무는 해당 개인정보가 복구나 재생되지 않도록 상업적으로 합리적이고 기술적으로 실현 가능한 조치를 취합니다. 개인정보를 포함하는 전자 문서나 파일은 해당 정보의 복구나 회수를 불가능하게 하는 기술적 방법을 이용하여 영구히 삭제됩니다. 개인정보를 포함하는 비전자적 문서 또는 파일은 파쇄하거나 소각합니다. 관련 법률에 따른 보유 및 이용 기간 이상 개인정보를 유지하여야 하는 경우에는 기술적으로 가능한 범위 내에서, 해당 개인정보를 가능한 한 다른 개인정보 항목들과 분리하여 저장 또는 보관합니다.<br />
      <br />
      <h3>19. 개인정보 처리의 위탁</h3><br />
      캐시나무의 특정한 제3자 서비스 제공자 및/또는 계열사는 캐시나무를 대리하여 기능을 수행하며 아래와 같이 기능을 수행하기 위해 필요한 개인정보에 접근할 수 있습니다.<br />
      <br />
      <h3>20. 이용자의 권리 및 행사 방법</h3><br />
      개인정보 접근 및 개인정보의 수집, 이용 및 공개에 대한 동의 철회와 관련한 이용자들의 권리와 행사 방법에 관해서는 “개인정보에의 동의 및 접근” 조항을 참고하시기 바랍니다.<br />
      <br />
      <h3>21. 연락처</h3><br />
      캐시나무의 개인정보보호책임자가 한국 내 캐시나무 이용자 및 고객의 개인정보 보호에 관한 사안 및 이러한 사안과 관련한 불만 처리를 담당합니다. 문의사항이 있거나 불만을 제기하고자 하는 경우, help@cashnamu.com 으로 연락하여 주시기 바랍니다.<br />
      <br />
      최종 업데이트일: 2022년 12월 28일<br />
    </>
  )
  return (
    <>
      {termText}
    </>
  );
};

export default page;
